app/Controllers/Admin/crud/Contributions.php

	public function index()
    {
        $rows = $this->model
            ->select('meal_contributions.*, meal_types.name AS meal_type, cafeterias.name AS cafeteria')
            ->join('meal_types','meal_types.id=meal_contributions.meal_type_id')
            ->join('cafeterias','cafeterias.id=meal_contributions.cafeteria_id','left')
            ->orderBy('meal_contributions.id','DESC')
            ->findAll(); // client-side DT
---
SELECT `meal_contributions`.*, `meal_types`.`name` AS `meal_type`, `cafeterias`.`name` AS `cafeteria`
FROM `meal_contributions`
JOIN `meal_types` ON `meal_types`.`id`=`meal_contributions`.`meal_type_id`
LEFT JOIN `cafeterias` ON `cafeterias`.`id`=`meal_contributions`.`cafeteria_id`
ORDER BY `meal_contributions`.`id` DESC

    public function new()
    {
        $db = db_connect();

        // active ET names (uppercase for stable comparisons)
        $etRows  = $db->table('employment_types')
                    ->select('UPPER(name) AS name')
                    ->where('is_active', 1)
                    ->orderBy('name', 'ASC')
                    ->get()->getResultArray();
        $etNames = array_map(fn($r) => (string) $r['name'], $etRows);

        // EMPLOYEE + ETs + GUEST (no duplicates)
        $typeOptions = array_values(array_unique(array_merge(['EMPLOYEE'], $etNames, ['GUEST'])));

        return view('admin/crud/contributions/form', [
            'row'         => null,
            'cafeterias'  => $this->cafModel->findAll(),
            'mealTypes'   => $this->mealTypeModel->findAll(),
---
SELECT UPPER(name) AS name
FROM `employment_types`
WHERE `is_active` = 1
ORDER BY `name` ASC
SELECT *
FROM `cafeterias`
SELECT *
FROM `meal_types`

    public function getBasePrice($mealTypeId)
    {
        $cost = $this->mealCostModel
            ->where('meal_type_id', $mealTypeId)
            ->orderBy('effective_date', 'DESC')
            ->first();
---
SELECT *
FROM `meal_costs`
WHERE `meal_type_id` = '1'
ORDER BY `effective_date` DESC
 LIMIT 1