app/Controllers/Admin/crud/MealCosts.php

    public function index()
    {
        // Client-side table: load all rows (with joins for labels)
        $costs = $this->model
            ->select('meal_costs.*, cafeterias.name AS cafeteria, meal_types.name AS meal_type')
            ->join('cafeterias','cafeterias.id = meal_costs.cafeteria_id','left')
            ->join('meal_types','meal_types.id = meal_costs.meal_type_id','left')
            ->orderBy('effective_date', 'DESC')
            ->findAll();
---
SELECT `meal_costs`.*, `cafeterias`.`name` AS `cafeteria`, `meal_types`.`name` AS `meal_type`
FROM `meal_costs`
LEFT JOIN `cafeterias` ON `cafeterias`.`id` = `meal_costs`.`cafeteria_id`
LEFT JOIN `meal_types` ON `meal_types`.`id` = `meal_costs`.`meal_type_id`
ORDER BY `effective_date` DESC

    public function new()
    {
        $cafeterias = $this->cafModel->findAll();
        $mealTypes  = $this->mealTypeModel->select('id,name')->where('is_active', '1')->findAll();
---
SELECT `id`, `name`
FROM `meal_types`
WHERE `is_active` = '1'